Autodesk.Navisworks.Api.Plugins.AddInPlugin
A plugin that can be called either using the GUI,
ApplicationAutomation
or using the Automation .NET API

Autodesk.Navisworks.Api.Plugins.AddInPlugin.#ctor
Default constructor for an AddInPlugin

Autodesk.Navisworks.Api.Plugins.AddInPlugin.CanExecute
This is called to determine the state of plugin.
Primarily if Execute can be called.

Autodesk.Navisworks.Api.Plugins.AddInPlugin.Execute(System.String[])
This method is called when the plugin is executed

Autodesk.Navisworks.Api.Plugins.AddInPlugin.TryShowHelp
Called to tell the plugin to display help
Returns:
Return true if you have handled this call